&НаСервере
Процедура ОбновитьСтатусДокумента() Экспорт
	
	Если ПометкаУдаления Тогда
		
		 ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Отклонён;
	
	ИначеЕсли ЭтотОбъект.УтвердитьПриказ Тогда
		
		ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Утверждён;
		
	Иначе      
		
		ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Проект;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСтатус()    
		
	КП_РаботаСRabbitMQКлиентСервер.ОтправитьСообщение(Строка(ЭтотОбъект.Статус));
		
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
	Если ЭтотОбъект.УтвердитьПриказ Тогда
		
			ОтправитьСтатус(); 	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	ОбновитьСтатусДокумента();	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СформироватьJSON()
	
	Данные = Новый Структура;
	Данные.Вставить("user", ЭтотОбъект.Ответственный);
	Данные.Вставить("status", ЭтотОбъект.Статус);
	Данные.Вставить("number", ЭтотОбъект.Номер);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	
	
КонецФункции


