
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КП_ПодарочныеСертификаты Приход
	Движения.КП_ПодарочныеСертификаты.Записывать = Истина;
	Для Каждого ТекСтрокаИнформацияОСписании Из ИнформацияОСписании Цикл
		Движение = Движения.КП_ПодарочныеСертификаты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ПодарочныйСертификат = ТекСтрокаИнформацияОСписании.ПодарочныйСертификат;
		Движение.Количество = ТекСтрокаИнформацияОСписании.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
