&НаКлиенте 
Перем УИДОП; 

&НаСервере
Функция ТекущийПольщователь()

	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда  
		
		Объект.Ответственный = ТекущийПольщователь(); 
		Объект.Статус = Перечисления.КП_СтатусыПриказа.Проект;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УИДОП = ОценкаПроизводительностиКлиент.ЗамерВремени("КП_ПриказПроведение", ,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДОП);
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьПриказПриИзменении(Элемент)

	Объект.Утвердил = ТекущийПольщователь();	
	
КонецПроцедуры



